# Pandas
<li>Pandas is an open-source Python package that is built on top of NumPy used for working with data sets.</li> 
<li>The name "Pandas" has a reference to <b>"Python Data Analysis".</b></li>
<li>Pandas is considered to be one of the best data-wrangling packages.</li>
<li>Pandas offers user-friendly, easy-to-use data structures and analysis tools for analyzing, cleaning, exploring and manipulating data.</li>
<li>It also functions well with various other data science Python modules.</li>

# Difference Between NumPy & Pandas

![](images/pandas_vs_numpy.png)

## Why Use Pandas?

<li>Pandas is known for its exceptional ability to represent and organize data.</li>
<li>The Pandas library was created to be able to work with large datasets faster and more efficiently than any other library.</li>
<li>It excels at analyzing huge amounts of data.Pandas allows us to analyze big data and make conclusions based on statistical theories.</li>
<li>Pandas can clean messy data sets, and make them readable and relevant.</li>
<li>By combining the functionality of Matplotlib and NumPy, Pandas offers users a powerful tool for performing <b>data analytics and visualization.</b></li>
<li>Data can be imported to Pandas from a variety of file formats, such as Csv, SQL, Excel, and JSON, among others.</li>
<li>Pandas is a versatile and marketable skill set for data analysts and data scientists that can gain the attention of employers.</li>

## Installation Of Pandas
<li>Go to your terminal, open and activate your virtual environment and then use the following commands for installing pandas.</li>

<code>
    pip install pandas
</code>

## Importing Pandas
<li>We need to import pandas if we want to create a pandas dataframe and perform any analysis on them.</li>
<li>We can import pandas package using the following command:</li>
<code>
    import pandas as pd
</code>

In [40]:
import pandas as pd

## How To Create A Pandas DataFrame
<li>A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, arranged in a table like structure with rows and columns.</li>
<li>We can create a basic pandas dataframe by various methods.</li>
<li>Let's discuss some of the methods to create the given dataframes:</li>

![](images/dataframe.png)

### 1. From Python Dictionary

In [41]:
dict= {
    'names': ['ram', 'shyam', 'hari'],
    'ages': [30, 25, 35],
    'addresses': ['kathmandu', 'bhaktapur', 'lalitpur']
}
df=pd.DataFrame(dict)
df

   names  ages  addresses
0    ram    30  kathmandu
1  shyam    25  bhaktapur
2   hari    35   lalitpur

### 2. From a list of dictionaries

In [42]:
list_of_dict=[
    {'name': 'ram', 'age': 30, 'address': 'kathmandu'},
    {'name': 'shyam', 'age': 25, 'address': 'bhaktapur'},
    {'name': 'hari', 'age': 35, 'address': 'lalitpur'}
]
df=pd.DataFrame(list_of_dict)
df

    name  age    address
0    ram   30  kathmandu
1  shyam   25  bhaktapur
2   hari   35   lalitpur

### 3. From a list of tuples

In [43]:
list_of_tuple=[
    ('ram', 30, 'kathmandu'),
    ('shyam', 25, 'bhaktapur'),
    ('hari', 35, 'lalitpur')
]
df=pd.DataFrame(list_of_tuple)
df

       0   1          2
0    ram  30  kathmandu
1  shyam  25  bhaktapur
2   hari  35   lalitpur

### 4. From list of lists

In [44]:
list_of_lists = [
    ['ram', 30, 'kathmandu'],
    ['shyam', 25, 'bhaktapur'],
    ['hari', 35, 'lalitpur']
]
df=pd.DataFrame(list_of_lists)
df

       0   1          2
0    ram  30  kathmandu
1  shyam  25  bhaktapur
2   hari  35   lalitpur

#### Question:
<li>Read 'weather_data.csv' file using csv reader.</li>
<li>Store the data inside the csv file into a list of lists.</li>
<li>Then create a pandas dataframe using list of list.</li>

In [45]:
df=pd.read_csv('./weather_data - weather_data.csv')
print(df)

     kfjkdfjskd     Unnamed: 1    Unnamed: 2 Unnamed: 3
0   dfuhsdjufio            NaN           NaN        NaN
1           day    temperature     windspeed      event
2      1/1/2017             32             6       Rain
3      1/4/2017  not available             9      Sunny
4      1/5/2017             -1  not measured       Snow
5      1/6/2017  not available             7   no event
6      1/7/2017             32  not measured       Rain
7      1/8/2017  not available  not measured      Sunny
8      1/9/2017  not available  not measured   no event
9     1/10/2017             34             8     Cloudy
10    1/11/2017             -4            -1       Snow
11    1/12/2017             26            12      Sunny
12    1/13/2017             12            12      Rainy
13    1/11/2017             -1            12       Snow
14    1/14/2017             40            -1      Sunny

In [46]:
#Store the data inside the csv file into a list of lists.
lists = df.values.tolist()

print(lists)

[['dfuhsdjufio', nan, nan, nan], ['day', 'temperature', 'windspeed', 'event'], ['1/1/2017', '32', '6', 'Rain'], ['1/4/2017', 'not available', '9', 'Sunny'], ['1/5/2017', '-1', 'not measured', 'Snow'], ['1/6/2017', 'not available', '7', 'no event'], ['1/7/2017', '32', 'not measured', 'Rain'], ['1/8/2017', 'not available', 'not measured', 'Sunny'], ['1/9/2017', 'not available', 'not measured', 'no event'], ['1/10/2017', '34', '8', 'Cloudy'], ['1/11/2017', '-4', '-1', 'Snow'], ['1/12/2017', '26', '12', 'Sunny'], ['1/13/2017', '12', '12', 'Rainy'], ['1/11/2017', '-1', '12', 'Snow'], ['1/14/2017', '40', '-1', 'Sunny']]

In [47]:
# Then create a pandas dataframe using list of list.
new_dataframe = pd.DataFrame(lists)

print(new_dataframe)

              0              1             2         3
0   dfuhsdjufio            NaN           NaN       NaN
1           day    temperature     windspeed     event
2      1/1/2017             32             6      Rain
3      1/4/2017  not available             9     Sunny
4      1/5/2017             -1  not measured      Snow
5      1/6/2017  not available             7  no event
6      1/7/2017             32  not measured      Rain
7      1/8/2017  not available  not measured     Sunny
8      1/9/2017  not available  not measured  no event
9     1/10/2017             34             8    Cloudy
10    1/11/2017             -4            -1      Snow
11    1/12/2017             26            12     Sunny
12    1/13/2017             12            12     Rainy
13    1/11/2017             -1            12      Snow
14    1/14/2017             40            -1     Sunny

#### Question
<li>1. Read 'imports-85.data' file using file reader.</li>
<li>2. Store the data present inside the file into a list of list.</li>
<li>3. Create a pandas dataframe using list of lists.</li>
<li>4. For column name, we can use the columns variable given below.</li>

In [48]:
# Step 1: Read 'imports-85.data' file using file reader
data = []
with open('./imports-85.data', 'r') as file:
    for line in file:
        data.append(line.strip().split(','))

# Print the first few lines of data to verify
print(data[:5])

[['3', '?', 'alfa-romero', 'gas', 'std', 'two', 'convertible', 'rwd', 'front', '88.60', '168.80', '64.10', '48.80', '2548', 'dohc', 'four', '130', 'mpfi', '3.47', '2.68', '9.00', '111', '5000', '21', '27', '13495'], ['3', '?', 'alfa-romero', 'gas', 'std', 'two', 'convertible', 'rwd', 'front', '88.60', '168.80', '64.10', '48.80', '2548', 'dohc', 'four', '130', 'mpfi', '3.47', '2.68', '9.00', '111', '5000', '21', '27', '16500'], ['1', '?', 'alfa-romero', 'gas', 'std', 'two', 'hatchback', 'rwd', 'front', '94.50', '171.20', '65.50', '52.40', '2823', 'ohcv', 'six', '152', 'mpfi', '2.68', '3.47', '9.00', '154', '5000', '19', '26', '16500'], ['2', '164', 'audi', 'gas', 'std', 'four', 'sedan', 'fwd', 'front', '99.80', '176.60', '66.20', '54.30', '2337', 'ohc', 'four', '109', 'mpfi', '3.19', '3.40', '10.00', '102', '5500', '24', '30', '13950'], ['2', '164', 'audi', 'gas', 'std', 'four', 'sedan', '4wd', 'front', '99.40', '176.60', '66.40', '54.30', '2824', 'ohc', 'five', '136', 'mpfi', '3.19', '3.40', '8.00', '115', '5500', '18', '22', '17450']]

In [49]:
columns = ['symboling', 'normalized_losses', 'make', 'fuel_type', 'aspiration', 'num_of_doors',
          'body_style', 'drive_wheels', 'engine_location', 'wheel_base', 'length', 'width', 
           'height', 'curb_weight', 'engine_type', 'num_of_cylinders', 'engine_size', 'fuel_system',
          'bore', 'stroke', 'compression', 'horsepower', 'peak_rpm', 'city_mpg', 'highway_mpg', 
           'price']
# Create a pandas DataFrame using the list of lists
df = pd.DataFrame(data, columns=columns)

# Print the DataFrame
print(df)

    symboling normalized_losses         make fuel_type aspiration  \
0           3                 ?  alfa-romero       gas        std
1           3                 ?  alfa-romero       gas        std
2           1                 ?  alfa-romero       gas        std
3           2               164         audi       gas        std
4           2               164         audi       gas        std
..        ...               ...          ...       ...        ...
200        -1                95        volvo       gas        std
201        -1                95        volvo       gas      turbo
202        -1                95        volvo       gas        std
203        -1                95        volvo    diesel      turbo
204        -1                95        volvo       gas      turbo

    num_of_doors   body_style drive_wheels engine_location wheel_base  ...  \
0            two  convertible          rwd           front      88.60  ...
1            two  convertible          rwd           front      88.60  ...
2            two    hatchback          rwd           front      94.50  ...
3           four        sedan          fwd           front      99.80  ...
4           four        sedan          4wd           front      99.40  ...
..           ...          ...          ...             ...        ...  ...
200         four        sedan          rwd           front     109.10  ...
201         four        sedan          rwd           front     109.10  ...
202         four        sedan          rwd           front     109.10  ...
203         four        sedan          rwd           front     109.10  ...
204         four        sedan          rwd           front     109.10  ...

    engine_size fuel_system  bore stroke compression horsepower peak_rpm  \
0           130        mpfi  3.47   2.68        9.00        111     5000
1           130        mpfi  3.47   2.68        9.00        111     5000
2           152        mpfi  2.68   3.47        9.00        154     5000
3           109        mpfi  3.19   3.40       10.00        102     5500
4           136        mpfi  3.19   3.40        8.00        115     5500
..          ...         ...   ...    ...         ...        ...      ...
200         141        mpfi  3.78   3.15        9.50        114     5400
201         141        mpfi  3.78   3.15        8.70        160     5300
202         173        mpfi  3.58   2.87        8.80        134     5500
203         145         idi  3.01   3.40       23.00        106     4800
204         141        mpfi  3.78   3.15        9.50        114     5400

    city_mpg highway_mpg  price
0         21          27  13495
1         21          27  16500
2         19          26  16500
3         24          30  13950
4         18          22  17450
..       ...         ...    ...
200       23          28  16845
201       19          25  19045
202       18          23  21485
203       26          27  22470
204       19          25  22625

[205 rows x 26 columns]

### 5. Pandas Dataframe From Csv files

<li>We can load a csv file and create a dataframe out of the data present inside a csv file using pandas.</li>
<li>We have <b>.read_csv()</b> method to read a csv file and create a pandas dataframe from the dataset.</li>

### Reading a csv file using skiprows and header parameters

In [50]:
# Load the CSV file into a DataFrame
df = pd.read_csv('./weather_data - weather_data.csv')

# Display the first few rows of the DataFrame
print(df.head())

    kfjkdfjskd     Unnamed: 1    Unnamed: 2 Unnamed: 3
0  dfuhsdjufio            NaN           NaN        NaN
1          day    temperature     windspeed      event
2     1/1/2017             32             6       Rain
3     1/4/2017  not available             9      Sunny
4     1/5/2017             -1  not measured       Snow

#### Reading a csv file without header and giving names to the columns

In [51]:
# Reading a csv file without header and giving names to the columns
columns=['Day','Temperature','Windspeed','Event']

weather_df=pd.read_csv("./weather_data - weather_data.csv",skiprows=3,names=columns)
weather_df

          Day    Temperature     Windspeed     Event
0    1/1/2017             32             6      Rain
1    1/4/2017  not available             9     Sunny
2    1/5/2017             -1  not measured      Snow
3    1/6/2017  not available             7  no event
4    1/7/2017             32  not measured      Rain
5    1/8/2017  not available  not measured     Sunny
6    1/9/2017  not available  not measured  no event
7   1/10/2017             34             8    Cloudy
8   1/11/2017             -4            -1      Snow
9   1/12/2017             26            12     Sunny
10  1/13/2017             12            12     Rainy
11  1/11/2017             -1            12      Snow
12  1/14/2017             40            -1     Sunny

#### Read limited data from a csv file using nrows parameters

In [52]:
weather_df=pd.read_csv("./weather_data - weather_data.csv",skiprows=3,nrows=5,header=None,names=columns)
weather_df

        Day    Temperature     Windspeed     Event
0  1/1/2017             32             6      Rain
1  1/4/2017  not available             9     Sunny
2  1/5/2017             -1  not measured      Snow
3  1/6/2017  not available             7  no event
4  1/7/2017             32  not measured      Rain

#### Reading csv files with na_values parameters ('weather_data.csv' file)

In [53]:
weather_df=pd.read_csv("./weather_data - weather_data.csv",skiprows=3,na_values=('not available','not measured','no event'))
weather_df

     1/1/2017    32     6    Rain
0    1/4/2017   NaN   9.0   Sunny
1    1/5/2017  -1.0   NaN    Snow
2    1/6/2017   NaN   7.0     NaN
3    1/7/2017  32.0   NaN    Rain
4    1/8/2017   NaN   NaN   Sunny
5    1/9/2017   NaN   NaN     NaN
6   1/10/2017  34.0   8.0  Cloudy
7   1/11/2017  -4.0  -1.0    Snow
8   1/12/2017  26.0  12.0   Sunny
9   1/13/2017  12.0  12.0   Rainy
10  1/11/2017  -1.0  12.0    Snow
11  1/14/2017  40.0  -1.0   Sunny

#### Write a pandas dataframe to a csv file
<li>We can write a pandas dataframe to a csv file using .to_csv() method.</li>
<li>You can specify any name to the csv file while writing a pandas dataframe into a csv file.</li>

In [54]:
weather_df.to_csv('weather-data0nan')

### 6. Pandas Dataframe From Xcel files

<li>We can load an excel file with <b>.xlsx</b> extension and create a dataframe out of the data present inside an excel file using pandas.</li>
<li>We have <b>.read_excel()</b> method to read a csv file and create a pandas dataframe from the dataset.</li>
<li>We also need to install <b>openpyxl</b> for working with excel files.</li>

In [55]:
# Load the Excel file into a DataFrame
df = pd.read_excel('./weather_data.xlsx')

# Display the DataFrame
print(df)

    Unnamed: 0        day  temperature  windspeed   event
0            0   1/1/2017         32.0        6.0    Rain
1            1   1/4/2017          NaN        9.0   Sunny
2            2   1/5/2017         -1.0        NaN    Snow
3            3   1/6/2017          NaN        7.0     NaN
4            4   1/7/2017         32.0        NaN    Rain
5            5   1/8/2017          NaN        NaN   Sunny
6            6   1/9/2017          NaN        NaN     NaN
7            7  1/10/2017         34.0        8.0  Cloudy
8            8  1/11/2017         -4.0        NaN    Snow
9            9  1/12/2017         26.0       12.0   Sunny
10          10  1/13/2017         12.0       12.0   Rainy
11          11  1/11/2017         -1.0       12.0    Snow
12          12  1/14/2017         40.0        NaN   Sunny

#### Writing to an excel file
<li>We can write a pandas dataframe into a excel file using .to_excel() method.</li>

In [56]:
# Write the DataFrame to an Excel file
df.to_excel('./weather_data.xlsx', index=False)

# Confirming the write operation
print("DataFrame successfully written to Excel file.")

DataFrame successfully written to Excel file.

#### Using head() and tail() method to see top 5 and last 5 rows
<li>To view the first few rows of our dataframe, we can use the DataFrame.head() method.</li>
<li>By default, it returns the first five rows of our dataframe.</li>
<li>However, it also accepts an optional integer parameter, which specifies the number of rows.</li>

<li>Similarly, to view the last few rows of our dataframe, we can use the DataFrame.tail() method.</li>
<li>By default, it returns the last five rows of our dataframe.</li>
<li>However, it also accepts an optional integer parameter, which specifies the number of rows.</li>

In [57]:
# View the first 5 rows of the DataFrame
print(df.head())

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017         32.0        6.0   Rain
1           1  1/4/2017          NaN        9.0  Sunny
2           2  1/5/2017         -1.0        NaN   Snow
3           3  1/6/2017          NaN        7.0    NaN
4           4  1/7/2017         32.0        NaN   Rain

In [58]:
# View the last 5 rows of the DataFrame
print(df.tail())

    Unnamed: 0        day  temperature  windspeed  event
8            8  1/11/2017         -4.0        NaN   Snow
9            9  1/12/2017         26.0       12.0  Sunny
10          10  1/13/2017         12.0       12.0  Rainy
11          11  1/11/2017         -1.0       12.0   Snow
12          12  1/14/2017         40.0        NaN  Sunny

#### Question:

<li>Use the head() method to select the first 6 rows.</li>
<li>Use the tail() method to select the last 8 rows.</li>

In [59]:
# View the first 6 rows of the DataFrame
print(df.head(6))

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017         32.0        6.0   Rain
1           1  1/4/2017          NaN        9.0  Sunny
2           2  1/5/2017         -1.0        NaN   Snow
3           3  1/6/2017          NaN        7.0    NaN
4           4  1/7/2017         32.0        NaN   Rain
5           5  1/8/2017          NaN        NaN  Sunny

In [60]:
# View the last 8 rows of the DataFrame
print(df.tail(8))

    Unnamed: 0        day  temperature  windspeed   event
5            5   1/8/2017          NaN        NaN   Sunny
6            6   1/9/2017          NaN        NaN     NaN
7            7  1/10/2017         34.0        8.0  Cloudy
8            8  1/11/2017         -4.0        NaN    Snow
9            9  1/12/2017         26.0       12.0   Sunny
10          10  1/13/2017         12.0       12.0   Rainy
11          11  1/11/2017         -1.0       12.0    Snow
12          12  1/14/2017         40.0        NaN   Sunny

#### Finding the column names from the dataframe
<li>We have df.columns attributes to check the name of columns in the pandas dataframe.</li>
<li>Similarly, we have df.values attributes to check the data present in the pandas dataframe.</li>

In [61]:
# Retrieve column names of the DataFrame
column_names = df.columns

# Display column names
print("Column names:", column_names)

Column names: Index(['Unnamed: 0', 'day', 'temperature', 'windspeed', 'event'], dtype='object')

In [62]:
# Retrieve data types of columns
column_data_types = df.dtypes

# Display data types of columns
print("Data types of columns:", column_data_types)

Data types of columns: Unnamed: 0       int64
day             object
temperature    float64
windspeed      float64
event           object
dtype: object

In [63]:
# Retrieve data from the DataFrame as a NumPy array
data_array = df.values

# Display data array
print("Data array:", data_array)

Data array: [[0 '1/1/2017' 32.0 6.0 'Rain']
 [1 '1/4/2017' nan 9.0 'Sunny']
 [2 '1/5/2017' -1.0 nan 'Snow']
 [3 '1/6/2017' nan 7.0 nan]
 [4 '1/7/2017' 32.0 nan 'Rain']
 [5 '1/8/2017' nan nan 'Sunny']
 [6 '1/9/2017' nan nan nan]
 [7 '1/10/2017' 34.0 8.0 'Cloudy']
 [8 '1/11/2017' -4.0 nan 'Snow']
 [9 '1/12/2017' 26.0 12.0 'Sunny']
 [10 '1/13/2017' 12.0 12.0 'Rainy']
 [11 '1/11/2017' -1.0 12.0 'Snow']
 [12 '1/14/2017' 40.0 nan 'Sunny']]

In [64]:
# Retrieve the size of the DataFrame
data_size = df.size

# Display the size of the DataFrame
print("Size of DataFrame:", data_size)

Size of DataFrame: 65

In [65]:
# Slicing values from the DataFrame
sliced_data = df.iloc[0:5, 0:3]  # Slicing first 5 rows and first 3 columns

# Display the sliced data
print("Sliced DataFrame:")
print(sliced_data)

Sliced DataFrame:
   Unnamed: 0       day  temperature
0           0  1/1/2017         32.0
1           1  1/4/2017          NaN
2           2  1/5/2017         -1.0
3           3  1/6/2017          NaN
4           4  1/7/2017         32.0

#### Checking the type of your dataframe 
<li>Another feature that makes pandas better for working with data is that dataframes can contain more than one data type.</li>
<li>Axis values can have string labels, not just numeric ones.</li>
<li>Dataframes can contain columns with multiple data types: including integer, float, and string.</li>
<li>We can use the DataFrame.dtypes attribute (similar to NumPy) to return information about the types of each column.</li>
<li>When we import data, pandas attempts to guess the correct dtype for each column.</li>
<li>Generally, pandas does well with this, which means we don't need to worry about specifying dtypes every time we start to work with data.</li>

In [66]:
weather_df_nan=df.dtypes
weather_df_nan

Unnamed: 0       int64
day             object
temperature    float64
windspeed      float64
event           object
dtype: object

#### Datatypes Information
<li>We can get the shape of the dataset using <b>.shape()</b> method.</li>
<li><b>.shape()</b> method returns the tuple datatype containing the number of rows and number of columns in the dataset.</li>
<li>If we wanted an overview of all the dtypes used in our dataframe, we can use <b>.info()</b> method.</li>
<li>Note that <b>DataFrame.info()</b> prints the information, rather than returning it, so we can't assign it to a variable.</li>

#### Checking the null values in the pandas dataframe

In [67]:
# Check for null values in the DataFrame
null_values = weather_df_nan.isnull().sum()

# Display the count of null values in each column
print("Null values in each column:")
print(null_values)

Null values in each column:
0

#### set_index() and reset_index() method

In [99]:
import pandas as pd

# Assuming you have a DataFrame named weather_df_nan

# Create a DataFrame
weather_data = {
    'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04'],
    'temperature': [20, 25, 22, 18],
    'humidity': [60, 65, 70, 75]
}
weather_df_nan = pd.DataFrame(weather_data)

# Display the original DataFrame
print("Original DataFrame:")
print(weather_df_nan)

# Set the 'date' column as the index using set_index()
weather_df_nan.set_index('date', inplace=True)
print("\nDataFrame after setting 'date' column as index:")
print(weather_df_nan)

# Reset the index using reset_index()
weather_df_nan.reset_index(inplace=True)
print("\nDataFrame after resetting index:")
print(weather_df_nan)

Original DataFrame:
         date  temperature  humidity
0  2022-01-01           20        60
1  2022-01-02           25        65
2  2022-01-03           22        70
3  2022-01-04           18        75

DataFrame after setting 'date' column as index:
            temperature  humidity
date
2022-01-01           20        60
2022-01-02           25        65
2022-01-03           22        70
2022-01-04           18        75

DataFrame after resetting index:
         date  temperature  humidity
0  2022-01-01           20        60
1  2022-01-02           25        65
2  2022-01-03           22        70
3  2022-01-04           18        75

#### Selecting a column from a pandas DataFrame

<li>Since our axis in pandas have labels, we can select data using those labels.</li> 
<li>Unlike in NumPy, we donot need to know the exact index location of a pandas dataframe.</li>
<li>To do this, we can use the DataFrame.loc[] attribute. The syntax for DataFrame.loc[] is:</li>
<code>
df.loc[row_label, column_label]
</code>

<li>We can use the following shortcut to select a single column:</li>
<code>
df["column_name"]
</code>

<li>This style of selecting columns is very common.</li>

#### Questions

<li>Read <b>'appointment_schedule.csv'</b> file using pandas.</li>
<li>Select the <b>'name'</b> column from the given dataset and store to <b>'appointment_names'</b> variable.</li>
<li>Use Python's <b>type()</b> function to assign the type of name column to <b>name_type</b>.</li>

In [69]:
# Read 'appointment_schedule.csv' file using pandas
df = pd.read_csv('./appointment_schedule - appointment_schedule.csv')

# Select the 'name' column
appointment_names = df['name']

# Assign the type of the 'name' column to 'name_type'
name_type = type(appointment_names.iloc[0])

# Print the first few values of 'appointment_names' and the type of 'name' column
print("First few values of 'appointment_names':")
print(appointment_names.head())

print("\nType of 'name' column:", name_type)

First few values of 'appointment_names':
0    Joshua T. Blanton
1      Jack T. Gutting
2    Bradley T. Guiles
3       Loryn F. Grieb
4     Travis D. Gordon
Name: name, dtype: object

Type of 'name' column: <class 'str'>

#### Pandas Series
<li>Series is the pandas type for one-dimensional objects.</li>
<li>Anytime you see a 1D pandas object, it will be a series. Anytime you see a 2D pandas object, it will be a dataframe.</li>
<li>A dataframe is a collection of series objects, which is similar to how pandas stores the data behind the scenes.</li>

#### Adding a column in a pandas dataframe

In [100]:
import pandas as pd

# Read 'appointment_schedule.csv' file using pandas
df = pd.read_csv('./appointment_schedule - appointment_schedule.csv')

# Assuming you want to add a new column 'name_length' containing the length of names in the 'name' column
df['name_length'] = df['name'].str.len()

# Display the updated DataFrame with the new column
print(df)

                    name appointment_made_date app_start_date   app_end_date  \
0      Joshua T. Blanton    2014-12-18 0:00:00    1/6/15 9:30   1/6/15 23:59
1        Jack T. Gutting    2014-12-18 0:00:00    1/6/15 9:30   1/6/15 23:59
2      Bradley T. Guiles    2014-12-18 0:00:00    1/6/15 9:30   1/6/15 23:59
3         Loryn F. Grieb    2014-12-18 0:00:00    1/6/15 9:30   1/6/15 23:59
4       Travis D. Gordon    2014-12-18 0:00:00    1/6/15 9:30   1/6/15 23:59
..                   ...                   ...            ...            ...
580       Ryan J. Morgan    2015-01-09 0:00:00  1/16/15 10:00  1/16/15 23:59
581  Alexander V. Nevsky    2015-01-09 0:00:00  1/16/15 10:00  1/16/15 23:59
582   Montana J. Johnson    2015-01-09 0:00:00  1/16/15 10:00  1/16/15 23:59
583  Joseph A. Pritchard    2015-01-09 0:00:00  1/16/15 10:00  1/16/15 23:59
584      Martin O. Reina    2015-01-09 0:00:00  1/16/15 10:00  1/16/15 23:59

    visitee_namelast visitee_namefirst meeting_room  \
0                NaN             potus    west wing
1                NaN             potus    west wing
2                NaN             potus    west wing
3                NaN             potus    west wing
4                NaN             potus    west wing
..               ...               ...          ...
580              NaN             potus    west wing
581              NaN             potus    west wing
582              NaN             potus    west wing
583              NaN             potus    west wing
584              NaN             potus    west wing

                           description  name_length
0    JointService Military Honor Guard           17
1    JointService Military Honor Guard           15
2    JointService Military Honor Guard           17
3    JointService Military Honor Guard           14
4    JointService Military Honor Guard           16
..                                 ...          ...
580               military honor guard           14
581               military honor guard           19
582               military honor guard           18
583               military honor guard           19
584               military honor guard           15

[585 rows x 9 columns]

### Selecting Multiple Columns From the DataFrame

![](images/selecting_columns.png)

<li>We can select multiple columns from the dataframe by using the following codes:</li>
<code>
    df.loc[:, ["col1", "col2"]]
</code>

<li>We can use syntax shortcuts for selecting multiple columns by using the following syntax:</li>
<code>
    df[["col1", "col2"]]
</code>

In [70]:
car_details_df = pd.read_csv('car_details.csv')
car_details_df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [71]:
car_details_df.loc[:, ['name', 'selling_price', 'km_driven']].head()

                       name  selling_price  km_driven
0             Maruti 800 AC          60000      70000
1  Maruti Wagon R LXI Minor         135000      50000
2      Hyundai Verna 1.6 SX         600000     100000
3    Datsun RediGO T Option         250000      46000
4     Honda Amaze VX i-DTEC         450000     141000

In [72]:
car_details_df[['name', 'selling_price', 'km_driven']].head()

                       name  selling_price  km_driven
0             Maruti 800 AC          60000      70000
1  Maruti Wagon R LXI Minor         135000      50000
2      Hyundai Verna 1.6 SX         600000     100000
3    Datsun RediGO T Option         250000      46000
4     Honda Amaze VX i-DTEC         450000     141000

In [73]:
car_details_limited = car_details_df.drop(['year', 'fuel', 'seller_type',
                                          'transmission', 'owner'],
                                          axis = 1)
car_details_limited.head()

                       name  selling_price  km_driven
0             Maruti 800 AC          60000      70000
1  Maruti Wagon R LXI Minor         135000      50000
2      Hyundai Verna 1.6 SX         600000     100000
3    Datsun RediGO T Option         250000      46000
4     Honda Amaze VX i-DTEC         450000     141000

#### Selecting Rows From A Pandas DataFrame

<li>Now that we've learned how to select columns by label, let's learn how to select rows using the labels of the index axis.</li>
<li>We can use the same syntax to select rows from a dataframe as we do for columns:</li>
<code>
    df.loc[row_label, column_label]
</code>

![](images/selecting_one_row.png)

### Selecting Multiple Rows From the DataFrame

![](images/selecting_multiple_rows.png)

#### Indexing & Slicing In Pandas DataFrame

<li>We can slice a dataset from their rows as well as columns.</li>
<li>If we have (5,5) shape data and we want first three rows and first three columns then we need to slice both rows and columns to get a desired shape.</li>
<li>We have df.iloc() method which we can use to do indexing as well as slicing in a dataframe.</li>
<li>Let's practice .iloc() method.</li>

#### Datatype Conversion In Pandas

<li>Pandas astype() is the one of the most important methods. It is used to change data type of a series.</li>
<li>When a pandas dataframe is created from a csv file,the data type is set automatically.</li>
<li>The datatype will not be what it actually should be at times and this is where we can use astype()  to get desired datatype.</li>
<li>For example, a salary column could be imported as string but to do operations we have to convert it into float.</li>
<li>astype() is used to do such data type conversions.</li>

#### Value Counts Method

<li>Since series and dataframes are two distinct objects, they have their own unique methods.</li>

<li>Let's look at an example of a series method - the Series.value_counts() method.</li>

<li>This method displays each unique non-null value in a column and their counts in order.</li>

<li>value_counts() is a series only method, we get the following error if we try to use it for dataframes:</li>

<code>
    AttributeError: 'DataFrame' object has no attribute 'value_counts'
</code>

#### Creating a frequency table from value_counts

#### Renaming the column names in a pandas dataframe

#### Selecting Items From A Series Method

<li>As with dataframes, we can use Series.loc[] to select items from a series using single labels, a list, or a slice object.</li>
<li>We can also omit loc[] and use bracket shortcuts for all three:</li>

![](images/selecting_series.png)

#### Question

<li>Use the value counts method to check the frequency count of different names from 'appointment_schedule.csv' file.</li>
<li>Select only first row from the series.</li>
<li>Select the first row and the last row from the series.</li>
<li>Select the first five rows and the last five rows from the series.</li>

#### DataFrame Vs DataSeries

![](images/dataframe_vs_series.png)

#### Summary

![](images/pandas_selection_summary.png)

#### Vecotrized Operations In Pandas

<li>We'll explore how pandas uses many of the concepts we learned in the NumPy.</li>
<li>Because pandas is designed to operate like NumPy, a lot of concepts and methods from Numpy are supported.</li>
<li>Recall that one of the ways NumPy makes working with data easier is with vectorized operations.</li>
<li>Just like with NumPy, we can use any of the standard Python numeric operators with series, including:</li>
<code>
    series_a + series_b - Addition
    series_a - series_b - Subtraction
    series_a * series_b - Multiplication
    series_a / series_b - Division
</code>

#### Some Statistical Functions In Pandas

<li>Like NumPy, Pandas supports many descriptive stats methods such as mean, median, mode, min, max and so on.</li>
<li>Here are a few of the most useful ones.</li>
<code>
Series.max()
Series.min()
Series.mean()
Series.median()
Series.mode()
Series.sum()
</code>
<li>We can calculate the average value of a particular column(series) using df.column_name.mean().</li>
<li>For calculating the minimum value in a particular column(series), we can use df.column_name.min().</li>
<li>Similarly, for calculating the maximum value in a particular column(series), we can use df.column_name.max().</li>

#### Finding the descriptive statistics of the dataframe using .describe() method

<li>Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset's distribution, excluding NaN values.</li>
<li>describe() method in Pandas is used to compute descriptive statistics for all of your numeric columns.</li>
<li>Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types.</li>
<li>The output will vary depending on what is provided.</li>
<li>If we want to see the descriptive statistics of an object datatype then we have to specify <b>df.describe(include = "O")</b></li>

#### Assigning Values With Pandas

<li>Just like in NumPy, the same techniques that we use to select data could be used for assignment.</li>

<li>When we selected a whole column by label and used assignment, we assigned the value to every item in that column.</li>

<li>By providing labels for both axes, we can assign them to a single value within our dataframe.</li>

<code>
    df.loc[row_label, col_label] = assignment_value
</code>

In [74]:
import pandas as pd

#### Using Boolean Indexing With Pandas Objects (Selection With Condition In Pandas)
<li>We can assign a value by using row label and column label in pandas.</li>
<li>But what if we need to assign a same value to a group of similar rows with the same criteria.</li>
<li> Instead, we can use boolean indexing to change all rows that meet the same criteria, just like we did with NumPy.</li>


<ol>
    <li>Equals: df['series'] == value</li>
    <li>Not Equals: df['series'] != value</li>
    <li>Less than: df['series'] < value</li>
    <li>Less than or equal to: df['series'] <= value</li>
    <li>Greater than: df['series'] > value</li>
    <li>Greater than or equal to: df['series'] >= value</li>
</ol>
<li>These conditions can be used in several ways, most commonly inside .loc to select values with conditions.</li>

### Using Pandas Method To Create a Boolean Mask

<li>In the last couple lessons, we used Python boolean operators to create boolean masks to select subsets of data.</li>
    
<li>There are also a number of pandas methods that return boolean masks useful for exploring data.</li>

<li>Two examples are the Series.isnull() method and Series.notnull() method.</li>
<li>Series.isnull() method can be used to select either rows that contain null (or NaN) values for a certain column.</li>
<li>Similarly, Series.notnull() method is used to select rows that do not contain null values for a certain column.</li>

#### Question 1

<li>Read 'Fortune_1000.csv' file using pandas read_csv() method and store it in a variable named f1000.</li>
<li>Select the rank, revenues, and rank_change columns in f1000. Then, use the df.head() method to select first five rows.</li>
<li>Select just the fifth row of the f1000 dataframe. Assign the result to fifth_row using iloc.</li>
<li>Select the value in first row of the company column. Assign the result to company_value.</li>
<li>Select the last three rows of the f1000 dataframe. Assign the result to last_three_rows.</li>
<li>Select the first to seventh rows and the first five columns of the f1000 dataframe.</li>

In [77]:
import pandas as pd

# Read 'Fortune_1000.csv' file using pandas read_csv() method and store it in a variable named f1000
f1000 = pd.read_csv('./fortune1000-final.csv')

# Check the column names in the DataFrame
print("Column names in the DataFrame:")
print(f1000.columns)

# Adjust the column names accordingly
selected_columns = ['rank', 'Revenues ($M)', 'Previous Rank']
# Select the rank, revenues, and rank_change columns in f1000. Then, use the df.head() method to select first five rows.
first_five_rows = f1000[selected_columns].head()
print("\nFirst five rows with selected columns:")
print(first_five_rows)

# Select just the fifth row of the f1000 dataframe. Assign the result to fifth_row using iloc.
fifth_row = f1000.iloc[4]  # Note that iloc is 0-based index, so index 4 refers to the fifth row
print("\nFifth row:")
print(fifth_row)

# Select the value in first row of the company column. Assign the result to company_value.
company_value = f1000.loc[0, 'title']
print("\nValue in the first row of the company column:", company_value)

# Select the last three rows of the f1000 dataframe. Assign the result to last_three_rows.
last_three_rows = f1000.tail(3)
print("\nLast three rows:")
print(last_three_rows)

# Select the first to seventh rows and the first five columns of the f1000 dataframe.
selected_rows_and_columns = f1000.iloc[0:7, 0:5]
print("\nFirst to seventh rows and first five columns:")
print(selected_rows_and_columns)

Column names in the DataFrame:
Index(['rank', 'title', 'Previous Rank', 'Revenues ($M)', 'Revenue Change',
       'Profits ($M)', 'Profit Change', 'Assets ($M)',
       'Mkt Value as of 3/29/18 ($M)', 'Employees', 'CEO', 'CEO Title',
       'Sector', 'Industry', 'Years on Fortune 500 List', 'City', 'State',
       'Latitude', 'Longitude'],
      dtype='object')

First five rows with selected columns:
   rank Revenues ($M) Previous Rank
0     1     $500,343              1
1     2     $244,363              4
2     3     $242,137              2
3     4     $229,234              3
4     5     $201,159              6

Fifth row:
rank                                                                  5
title                                                UnitedHealth Group
Previous Rank                                                         6
Revenues ($M)                                                 $201,159
Revenue Change                                                    8.80%
Profits ($M)                                                $10,558.00
Profit Change                                                    50.50%
Assets ($M)                                                   $139,058
Mkt Value as of 3/29/18 ($M)                                  $207,080
Employees                                                       260,000
CEO                                                   David S. Wichmann
CEO Title                           Chairman &  Chief Executive Officer
Sector                                                      Health Care
Industry                        Health Care: Insurance and Managed Care
Years on Fortune 500 List                                            24
City                                                         Minnetonka
State                                                                MN
Latitude                                                      44.921184
Longitude                                                    -93.468749
Name: 4, dtype: object

Value in the first row of the company column: Walmart

Last three rows:
     rank         title Previous Rank Revenues ($M) Revenue Change  \
997   998     CoreLogic           952       $1,851          -5.20%
998   999  Ensign Group           NaN       $1,849          11.80%
999  1000           HCP           798       $1,848         -27.20%

    Profits ($M) Profit Change Assets ($M) Mkt Value as of 3/29/18 ($M)  \
997     $152.20         42.80%     $4,077                       $3,694
998      $40.50        -19.00%     $1,102                       $1,354
999     $414.20        -34.00%    $14,089                      $10,910

    Employees                         CEO  \
997     5,900            Frank D. Martell
998    21,301  Christopher R. Christensen
999       190            Thomas M. Herzog

                                          CEO Title             Sector  \
997  President, Chief Executive Officer &  Director  Business Services
998  President, Chief Executive Officer &  Director        Health Care
999  President, Chief Executive Officer &  Director         Financials

                            Industry Years on Fortune 500 List           City  \
997          Financial Data Services                         -         Irvine
998  Health Care: Medical Facilities                         -  Mission Viejo
999                      Real estate                         -         Irvine

    State   Latitude   Longitude
997    CA  33.684567 -117.826505
998    CA  33.596891 -117.658156
999    CA  33.684567 -117.826505

First to seventh rows and first five columns:
   rank               title Previous Rank Revenues ($M) Revenue Change
0     1             Walmart             1     $500,343           3.00%
1     2         Exxon Mobil             4     $244,363          17.40%
2     3  Berkshire Hathaway             2     $242,137           8.30%
3     4               Apple             3     $229,234           6.30%
4     5  UnitedHealth Group             6     $201,159           8.80%
5     6            McKesson             5     $198,533           3.10%
6     7          CVS Health             7     $184,765           4.10%

#### Question 2
<li>Use the Series.isnull() method to select all rows from f1000 that have a null value for the prev_rank column.</li>
<li>Select only the company, rank, and previous_rank columns where previous_rank column is null.</li>
<li>Use the Series.notnull() method to select all rows from f1000 that have a non-null value for the previous_rank column.</li></b>
<li>From the previously_ranked dataframe, subtract the rank column from the previous_rank column.</li>
<li>Assign the values in the rank_change to a new column in the f1000 dataframe, "rank_change".</li>

In [79]:
import pandas as pd

# Read 'Fortune_1000.csv' file using pandas read_csv() method and store it in a variable named f1000
f1000 = pd.read_csv('./fortune1000-final.csv')

# Check the data type of the 'Previous Rank' column
print("Data type of 'Previous Rank' column:", f1000['Previous Rank'].dtype)

# Convert 'Previous Rank' column to numeric if it's not already
f1000['Previous Rank'] = pd.to_numeric(f1000['Previous Rank'], errors='coerce')

# Use the Series.isnull() method to select all rows from f1000 that have a null value for the prev_rank column.
null_prev_rank_rows = f1000[f1000['Previous Rank'].isnull()]

# Select only the company, rank, and previous_rank columns where previous_rank column is null.
null_prev_rank_data = null_prev_rank_rows[['title', 'rank', 'Previous Rank']]

# Use the Series.notnull() method to select all rows from f1000 that have a non-null value for the previous_rank column.
non_null_prev_rank_rows = f1000[f1000['Previous Rank'].notnull()]

# From the previously_ranked dataframe, subtract the rank column from the previous_rank column.
previously_ranked = non_null_prev_rank_rows.copy()
previously_ranked['rank_change'] = previously_ranked['Previous Rank'] - previously_ranked['rank']

# Assign the values in the rank_change to a new column in the f1000 dataframe, "rank_change".
f1000['rank_change'] = previously_ranked['rank_change']

# Display the first few rows of the updated dataframe
print(f1000.head())

Data type of 'Previous Rank' column: object
   rank               title  Previous Rank Revenues ($M) Revenue Change  \
0     1             Walmart            1.0     $500,343           3.00%
1     2         Exxon Mobil            4.0     $244,363          17.40%
2     3  Berkshire Hathaway            2.0     $242,137           8.30%
3     4               Apple            3.0     $229,234           6.30%
4     5  UnitedHealth Group            6.0     $201,159           8.80%

  Profits ($M) Profit Change Assets ($M) Mkt Value as of 3/29/18 ($M)  \
0   $9,862.00        -27.70%   $204,522                     $263,563
1  $19,710.00        151.40%   $348,691                     $316,157
2  $44,940.00         86.70%   $702,095                     $492,008
3  $48,351.00          5.80%   $375,319                     $851,318
4  $10,558.00         50.50%   $139,058                     $207,080

   Employees                  CEO  \
0  2,300,000  C. Douglas McMillon
1     71,200      Darren W. Woods
2    377,000    Warren E. Buffett
3    123,000      Timothy D. Cook
4    260,000    David S. Wichmann

                                        CEO Title       Sector  \
0  President, Chief Executive Officer &  Director    Retailing
1             Chairman &  Chief Executive Officer       Energy
2  Chairman, President &  Chief Executive Officer   Financials
3             Chairman &  Chief Executive Officer   Technology
4             Chairman &  Chief Executive Officer  Health Care

                                   Industry Years on Fortune 500 List  \
0                     General Merchandisers                        24
1                        Petroleum Refining                        24
2  Insurance: Property and Casualty (Stock)                        24
3               Computers, Office Equipment                        24
4   Health Care: Insurance and Managed Care                        24

          City State   Latitude   Longitude  rank_change
0  Bentonville    AR  36.372854  -94.208817          0.0
1       Irving    TX  32.814018  -96.948894          2.0
2        Omaha    NE  41.256537  -95.934503         -1.0
3    Cupertino    CA  37.322998 -122.032182         -1.0
4   Minnetonka    MN  44.921184  -93.468749          1.0

#### Question 3
<li>Select all companies with revenues over 100 thousands and negative profits from the f1000 dataframe.</li>

##### Instructions

<li>Create a boolean array that selects the companies with revenues greater than 100 thousands.</li>
<li>Create a boolean array that selects the companies with profits less than 0.</li>

In [82]:
import pandas as pd

# Read 'fortune1000-final.csv' file using pandas read_csv() method and store it in a variable named f1000
f1000 = pd.read_csv('fortune1000-final.csv')

# Convert 'Revenues ($M)' column to numeric type, coerce errors to NaN for non-numeric values
f1000['Revenues ($M)'] = pd.to_numeric(f1000['Revenues ($M)'], errors='coerce')

# Convert 'Profits ($M)' column to numeric type, coerce errors to NaN for non-numeric values
f1000['Profits ($M)'] = pd.to_numeric(f1000['Profits ($M)'], errors='coerce')

# Create a boolean array that selects the companies with revenues greater than 100 thousands
revenues_gt_100k = f1000['Revenues ($M)'] > 100

# Create a boolean array that selects the companies with profits less than 0
negative_profits = f1000['Profits ($M)'] < 0

# Select all companies with revenues over 100 thousands and negative profits from the f1000 dataframe
selected_companies = f1000[revenues_gt_100k & negative_profits]

# Display selected companies
print(selected_companies)

Empty DataFrame
Columns: [rank, title, Previous Rank, Revenues ($M), Revenue Change, Profits ($M), Profit Change, Assets ($M), Mkt Value as of 3/29/18 ($M), Employees, CEO, CEO Title, Sector, Industry, Years on Fortune 500 List, City, State, Latitude, Longitude]
Index: []

#### Question 4
<li>Select all rows for companies whose city value is either Brazil or Venezuela.</li>
<li>Select the first five companies in the Technology sector for which the city is not the "Boston" from the f1000 dataframe.</li>

In [83]:
import pandas as pd

# Read 'fortune1000-final.csv' file using pandas read_csv() method and store it in a variable named f1000
f1000 = pd.read_csv('fortune1000-final.csv')

# Select all rows for companies whose city value is either Brazil or Venezuela.
selected_countries = f1000[(f1000['City'] == 'Brazil') | (f1000['City'] == 'Venezuela')]

# Display selected rows
print("Companies in Brazil or Venezuela:")
print(selected_countries)

# Select the first five companies in the Technology sector for which the city is not "Boston".
selected_tech_companies = f1000[(f1000['Sector'] == 'Technology') & (f1000['City'] != 'Boston')].head(5)

# Display selected rows
print("\nFirst five Technology sector companies (excluding Boston):")
print(selected_tech_companies)

Companies in Brazil or Venezuela:
Empty DataFrame
Columns: [rank, title, Previous Rank, Revenues ($M), Revenue Change, Profits ($M), Profit Change, Assets ($M), Mkt Value as of 3/29/18 ($M), Employees, CEO, CEO Title, Sector, Industry, Years on Fortune 500 List, City, State, Latitude, Longitude]
Index: []

First five Technology sector companies (excluding Boston):
    rank              title Previous Rank Revenues ($M) Revenue Change  \
3      4              Apple             3     $229,234           6.30%
21    22           Alphabet            27     $110,855          22.80%
29    30          Microsoft            28      $89,950           5.40%
33    34                IBM            32      $79,139          -1.00%
34    35  Dell Technologies            41      $78,660          21.40%

   Profits ($M) Profit Change Assets ($M) Mkt Value as of 3/29/18 ($M)  \
3   $48,351.00          5.80%   $375,319                     $851,318
21  $12,662.00        -35.00%   $197,295                     $719,124
29  $21,204.00         26.20%   $241,086                     $702,760
33   $5,753.00        -51.50%   $125,356                     $141,335
34  ($3,728.00)             -   $122,281                             -

   Employees                  CEO  \
3    123,000      Timothy D. Cook
21    80,110           Larry Page
29   124,000        Satya Nadella
33   397,800  Virginia M. Rometty
34   145,000      Michael S. Dell

                                         CEO Title      Sector  \
3              Chairman &  Chief Executive Officer  Technology
21             Chief Executive Officer &  Director  Technology
29             Chief Executive Officer &  Director  Technology
33  Chairman, President &  Chief Executive Officer  Technology
34             Chairman &  Chief Executive Officer  Technology

                           Industry Years on Fortune 500 List           City  \
3       Computers, Office Equipment                        24      Cupertino
21  Internet Services and Retailing                        13  Mountain View
29                Computer Software                        24        Redmond
33  Information Technology Services                        24         Armonk
34      Computers, Office Equipment                        21     Round Rock

   State   Latitude   Longitude
3     CA  37.322998 -122.032182
21    CA  37.386052 -122.083851
29    WA  47.673988 -122.121512
33    NY  41.126485  -73.714020
34    TX  30.508255  -97.678896

#### Sorting Values
<li>We can use the DataFrame.sort_values() method to sort the rows on a particular column.</li>
<li>To do so, we pass the column name to the method:</li>
<code>
sorted_rows = df.sort_values("column_name")
</code>
<li>By default, the sort_values() method will sort the rows in ascending order — from smallest to largest.</li>
<li>To sort the rows in descending order instead, we can set the ascending parameter to False:</li>
<code>
    sorted_rows = df.sort_values("column_name", ascending=False)
</code>

#### Question
<li>Read 'Fortune_1000.csv' using pandas read_csv() method.</li>
<li>Find the company headquartered in Los Angeles with the largest number of employees.</li>
<li>Select only the rows that have a city name equal to Los Angeles.</li>
<li>Use DataFrame.sort_values() to sort those rows by the employees column in descending order.</li>
<li>Use DataFrame.iloc[] to select the first row from the sorted dataframe.</li>

In [84]:
import pandas as pd

# Read 'Fortune_1000.csv' using pandas read_csv() method
f1000 = pd.read_csv('fortune1000-final.csv')

# Select only the rows that have a city name equal to Los Angeles
los_angeles_companies = f1000[f1000['City'] == 'Los Angeles']

# Use DataFrame.sort_values() to sort those rows by the employees column in descending order
sorted_los_angeles_companies = los_angeles_companies.sort_values(by='Employees', ascending=False)

# Use DataFrame.iloc[] to select the first row from the sorted dataframe
company_with_most_employees_in_LA = sorted_los_angeles_companies.iloc[0]

# Print the company with the largest number of employees headquartered in Los Angeles
print("Company headquartered in Los Angeles with the largest number of employees:")
print(company_with_most_employees_in_LA)

Company headquartered in Los Angeles with the largest number of employees:
rank                                                            930
title                                         Oaktree Capital Group
Previous Rank                                                   NaN
Revenues ($M)                                               $2,100
Revenue Change                                               38.30%
Profits ($M)                                               $231.50
Profit Change                                                18.90%
Assets ($M)                                                 $9,015
Mkt Value as of 3/29/18 ($M)                                $6,188
Employees                                                       930
CEO                                                  Jay S. Wintrob
CEO Title                       Chairman &  Chief Executive Officer
Sector                                                   Financials
Industry                                                 Securities
Years on Fortune 500 List                                         -
City                                                    Los Angeles
State                                                            CA
Latitude                                                  34.052234
Longitude                                               -118.243685
Name: 929, dtype: object

### String Manipulation In Pandas DataFrame

<li>String manipulation is the process of changing, parsing, splitting, 'cleaning' or analyzing strings.</li>
<li>As we know that sometimes, data in the string is not suitable for manipulating the analysis or get a description of the data.</li>
<li>But Python is known for its ability to manipulate strings.</li>
<li>Pandas provides us the ways to manipulate to modify and process string data-frame using some builtin functions.</li>
<li>Some of the most useful pandas string processing functions are as follows:</li>
<ol>
    <li><b>lower()</b></li>
    <li><b>upper()</b></li>
    <li><b>islower()</b></li>
    <li><b>isupper()</b></li>
    <li><b>isnumeric()</b></li>
    <li><b>strip()</b></li>
    <li><b>split()</b></li>
    <li><b>len()</b></li>
    <li><b>get_dummies()</b></li>
    <li><b>startswith()</b></li>
    <li><b>endswith()</b></li>
    <li><b>replace()</b></li>
    <li><b>contains()</b></li>
</ol>

#### 1. lower(): 
<li>It converts all uppercase characters in strings in the dataframe to lower case and returns the lowercase strings in the result.</li>

#### 2. upper():
<li>It converts all lowercase characters in strings in the dataframe to upper case and returns the uppercase strings in result.</li>

#### 3. islower(): 
<li>It checks whether all characters in each string in the Data-Frame is in lower case or not, and returns a Boolean value.</li>

#### 4. isupper(): 
<li>It checks whether all characters in each string in the Data-Frame is in upper case or not, and returns a Boolean value.</li>

#### 5. isnumeric():
<li>It checks whether all characters in each string in the Data-Frame are numeric or not, and returns a Boolean value.</li>

#### 6. strip():
<li>If there are spaces at the beginning or end of a string, we should trim the strings to eliminate spaces using strip() method.</li>
<li>It remove the extra spaces contained by a string in a DataFrame.</li>

#### 7. split(‘ ‘):
<li>It splits each string with the given pattern.</li>
<li>Strings are split and the new elements after the performed split operation, are stored in a list.</li>

#### 8. len():
<li>With the help of len() we can compute the length of each string in DataFrame.</li>
<li>If there is empty data in a DataFrame, it returns NaN.</li>

#### 9. get_dummies(): 
<li>It returns the DataFrame with One-Hot Encoded values like we can see that it returns boolean value 1 if it exists in relative index or 0 if not exists.</li>

#### 10. startswith(pattern):
<li>It returns true if the element or string in the DataFrame Index starts with the pattern.</li>
<li>If you wanted to filter out rows that startswith 'ind' then you can specify df[df[col].str.startswith('ind')</li>

#### 11. endswith(pattern):
<li>It returns true if the element or string in the DataFrame Index ends with the pattern.</li>
<li>If you wanted to filter out rows that ends with 'es' then you can specify df[df[col].str.endswith('es')</li>

#### 12. replace(a,b):
<li>It replaces the value a with the value b.</li>
<li>If you wanted to remove white space characters then you can use replace() method as:</li>
<code>
df[col_name].str.replace(" ", "")
</code>

#### 13. contains():
<li>contains() method checks whether the string contains a particular substring or not.</li>
<li>The function is quite similar to replace() but instead of replacing the string itself it just returns the boolean value True or False.</li>
<li>If a substring is present in a string, then it returns boolean value True else False.</li>

#### Handling Missing Values
<li>We can use fillna() method in pandas to fill missing values using different ways.</li>
<li>We can use interpolation method to make a guess on missing values.</li>
<li>We can use dropna() method to drop rows with missing values.</li>
<li>We can also fill missing values with the mean value, median value or the mode value depending on the values of columns.</li>
<li>Filling missing values with mean and median is appropriate when the column has continuous values.</li>
<li>If the data is categorical then filling missing values with mode is a good idea.</li>

#### fillna(method = 'ffill')

#### fillna(method = 'bfill')

#### Interpolate(Linear Interpolation)
<li>method = time</li>

#### dropna()
<li>dropna() with how and threshold parameter</li>

#### Handle Missing Values using .replace() method

#### Replacing Values Using a Dictionary (using columns and without using columns)

#### Replacing values using a regex
<code>
df.replace(original_value, replaced_value, regex = True)
</code>

#### Mapping values of a particular column using replace method
<li>Replacing the list of values using another list of values</li>
<li>Replacing values of a particular column using a dictionary</li>

#### GroupBy Functions
<li>Pandas groupby is used for grouping the data according to the categories and apply a function to the categories.</li>
<li>It also helps to aggregate data efficiently.</li>
<li>Pandas dataframe.groupby() function is used to split the data into groups based on some criteria.</li>
<code>
    df.groupby(col_name, as_index, sort, dropna)
</code>
<li>It uses split, apply, combine principle to create a groupby dataframe.</li>
<li>The groupby function accepts multiple parameters. Some of them are as follows:</li>
<ol>
    <li>col_name(required): the name of column against which you want to group elements.</li>
    <li>as_index(optional): default = True, if you want to include groupby column as an index set it        to True else False.</li>
    <li>sort(optional): default = True, if you want to sort the group based on keys then keep it as       True else False.</li>
    <li>dropna(optional): default = True, if you keep it as false then it will also include Nan values     as a separate group.</li>
</ol>

### GroupBy Aggregation Functions
<li>Here are some of the aggregating functions available in Pandas and quick summary of what it does.</li>
<ol>
    <li>mean(): Compute mean of groups for numeric columns</li>
    <li>sum(): Compute sum of group values for numeric columns</li>
    <li>size(): Compute group sizes</li>
    <li>count(): Compute count of group</li>
    <li>std(): Standard deviation of groups for numeric columns</li>
    <li>var(): Compute variance of groups for numeric columns</li>
    <li>describe(): Generates descriptive statistics</li>
    <li>first(): Compute first of group values</li>
    <li>last(): Compute last of group values</li>
    <li>nth() : Take nth value, or a subset if n is a list</li>
    <li>min(): Compute min of group values</li>
    <li>max(): Compute max of group values</li>
</ol>

#### Question
<li>Read 'car_details.csv' file and create a pandas dataframe from this file.</li>
<li>Find the maximum price for each of the car brand.</li>
<li>Find the average price for each of the fuel types.</li>
<li>Find the average km_driven for each of the seller_types.</li>
<li>Find the count of each of the car names.</li>
<li>Find the maximum km_driven for each of the owner types.</li>

In [88]:
import pandas as pd

# Read 'car_details.csv' file and create a pandas dataframe from this file
car_details_df = pd.read_csv('./car_details.csv')

# Find the maximum price for each of the car brand
max_price_per_brand = car_details_df.groupby('name')['selling_price'].max()

# Find the average price for each of the fuel types
avg_price_per_fuel_type = car_details_df.groupby('fuel')['selling_price'].mean()

# Find the average km_driven for each of the seller_types
avg_km_driven_per_seller_type = car_details_df.groupby('seller_type')['km_driven'].mean()

# Find the count of each of the car names
car_name_counts = car_details_df['name'].value_counts()

# Find the maximum km_driven for each of the owner types
max_km_driven_per_owner_type = car_details_df.groupby('owner')['km_driven'].max()

# Print the results
print("Maximum price for each car brand:")
print(max_price_per_brand)
print("\nAverage price for each fuel type:")
print(avg_price_per_fuel_type)
print("\nAverage km driven for each seller type:")
print(avg_km_driven_per_seller_type)
print("\nCount of each car name:")
print(car_name_counts)
print("\nMaximum km driven for each owner type:")
print(max_km_driven_per_owner_type)

Maximum price for each car brand:
name
Ambassador CLASSIC 1500 DSL AC           120000
Ambassador Classic 2000 Dsz               50000
Ambassador Grand 1800 ISZ MPFI PW CL     430000
Audi A4 1.8 TFSI                        1200000
Audi A4 2.0 TDI                         1295000
                                         ...
Volkswagen Vento Petrol Highline AT      300000
Volvo V40 D3 R Design                   1975000
Volvo XC 90 D5 Inscription BSIV         4500000
Volvo XC60 D3 Kinetic                   1750000
Volvo XC60 D5 Inscription               2000000
Name: selling_price, Length: 1491, dtype: int64

Average price for each fuel type:
fuel
CNG         277174.925000
Diesel      669094.252206
Electric    310000.000000
LPG         167826.043478
Petrol      344840.137541
Name: selling_price, dtype: float64

Average km driven for each seller type:
seller_type
Dealer              52827.259557
Individual          71167.556104
Trustmark Dealer    39202.215686
Name: km_driven, dtype: float64

Count of each car name:
name
Maruti Swift Dzire VDI                     69
Maruti Alto 800 LXI                        59
Maruti Alto LXi                            47
Maruti Alto LX                             35
Hyundai EON Era Plus                       35
                                           ..
Hyundai Verna Transform CRDi VGT SX ABS     1
Maruti S-Presso VXI Plus                    1
Toyota Etios Liva 1.2 VX                    1
Toyota Yaris G                              1
Hyundai i20 Magna 1.4 CRDi                  1
Name: count, Length: 1491, dtype: int64

Maximum km driven for each owner type:
owner
First Owner             806599
Fourth & Above Owner    245244
Second Owner            350000
Test Drive Car           24585
Third Owner             400000
Name: km_driven, dtype: int64

####  Concatenating DataFrames
<li>pandas.concat() function does all the heavy lifting of performing concatenation operations along with an axis</li>
<li>If we want to join two individual dataframes and create a combined dataframe out of it, we can use concatenation operation for doing so.</li>
<li>We can use concatenation operation along the rows(axis=0) as well as along the columns(axis = 1)</li>

**syntax**

<code>
    pd.concat([df1,df2], axis, keys, ignore_index)
</code>

<li>df1 and df2 (required) are two dataframes which we want to merge.</li>
<li>axis: axis to concatenate along, (possible values; 0(along the rows) and 1 (along the cols) default = 0 (along the rows).</li>
<li>keys: sequence to add an identifier to the result indexes; default = None</li>
<li>ignore_index: if True, do not use the index values along the concatenation axis; default = False</li>

#### Concatenating Dataframes along the rows
![](images/concat_rows.png)

#### Concatenating DataFrames along columns
![](images/concat_cols.png)

#### Merge
<li>Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.</li>
<li>Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects.</li>
<li>The <b>merge()</b> method updates the content of two DataFrame by merging them together, using the specified method(s).</li>
<li>We can use the parameters to control which values to keep and which to replace during merge operation.</li>
<li>We can specify any type of join we want by using how parameter in merge method.</li>
<li>There are four types of join operations. They are :</li>
<ol>
    <b><li>Inner join</li></b>
    <b><li>Left join</li></b>
    <b><li>Right join</li></b>
    <b><li>Outer join</li></b>
</ol>

#### 1. Inner Join
![](images/inner_join.png)

#### 2. Left Join

![](images/left_join.png)

#### 3. Right Join

![](images/right_join.png)

#### 4. Outer Join

![](images/outer_join.png)

#### Crosstab 

<li>Cross tabulation is used to quantitatively analyze the relationship between multiple variables.</li>
<li>Cross tabulations — also referred to as contingency tables or crosstabs.</li>
<li>They group variables together and enable researchers to understand the correlation between different variables.<li>
<li>When we are doing multivariate analysis then we often came across crosstab() methods in pandas.</li>

**Syntax**

<code>
    pd.crosstab(index, columns, values, margins, margin_names, normalize,aggfunc, dropna)
</code>
<ol>
    <li>index : array-like, Series, or list of arrays/Series, Values to group by in the rows.</li>
    <li>columns : array-like, Series, or list of arrays/Series, Values to group by in the columns.</li>
    <li>values : array-like, optional, array of values to aggregate according to the factors. Requires `aggfunc` be specified.     </li>
    <li>aggfunc : function, optional, If specified, requires `values` be specified as well.</li>
    <li>margins : bool, default False, Add row/column margins (subtotals).</li>
    <li>margins_name : str, default ‘All’, Name of the row/column that will contain the totals when margins is True.</li>
    <li>dropna : bool, default True, Do not include columns whose entries are all NaN.</li>
    <li>normalize: </li>
    <ol>
        <li>If passed ‘all’ or True, will normalize over all values.</li>
        <li>If passed ‘index’ will normalize over each row.</li>
        <li>If passed ‘columns’ will normalize over each column.</li>
        <li>If margins is True, will also normalize margin values.</li>
    </ol>
</ol>

#### Pivot
<li>pivot() method produces pivot table based on 3 columns of the DataFrame. Uses unique values from index / columns and fills with values.</li>

    
**syntax**
<code>
pd.pivot(index, columns, values)
</code>
    
<b>Parameters:</b>
<ol>
    <li>index[ndarray] : Labels to use to make new frame’s index</li>
    <li>columns[ndarray] : Labels to use to make new frame’s columns</li>
    <li>values[ndarray] : Values to use for populating new frame’s values</li>
</ol>

**Returns: Reshaped DataFrame**

**Exception: ValueError raised if there are any duplicates.**